---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ContentNode Properties
ContentNode Class See Also Send Feedback
---

The ContentNode type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RenderNode.) |
|  | NodeName | A readable name of the output node.  (Inherited from RenderNode.) |

# See Also

ContentNode Class

Autodesk.Revit.DB Namespace